EDT/MPCurier/src/Catalogs/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказы</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяПоследнейМаршрутизацииВМП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьКИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретСменыТипаОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.ИнтернетМагазины</types>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьДоставки</name>
    <type>
      <types>CatalogRef.КалендариДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганизацияОплатаБСП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганизацияОплатаНаличные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганизацияОплатаТерминал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплатыПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаИМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьЧекНаEMAILПолучателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодъемОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательEMAIL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДССуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказаИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказаИтогоУчитывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСтоимостьТоваровЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаПримерки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.ИнтернетМагазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьДанныеПодъема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЗоныТарификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетСтоимостиДоставки</name>
    <attributes>
      <name>СуммаВыкупа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоставщикТовара</name>
      <type>
        <types>CatalogRef.ПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/MPCurier/src/Catalogs/Рейсы/Рейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Рейсы</name>
  <attributes>
    <name>НомерРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Транспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.Экспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыданТерминалAssist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспечатанМЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/MPCurier/src/Catalogs/Заказы/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если Не МобильноеПриложениеСервер Тогда
		Элементы.ВыбранныйТипОплаты.Видимость = Ложь;  	
	#КонецЕсли
	
	ЗаполнитьСписокРейсовНаСервере();
	ПоискИУстановкаРейсаНаСегодняНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОповещенияВыполненОбменСЦУ", ЭтотОбъект);
	//@skip-check bsl-legacy-check-dynamic-feature-access
	УведомленияКлиента.ПодключитьОбработчик("ВыполненОбменСЦУ", ОписаниеОповещения);
	РейсПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененСтатус" Тогда
		ОбновитьСпискиНаКлиенте();
	КонецеСли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	РейсПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйТипОплатыПриИзменении(Элемент)
	
	УстановитьОтборВыбранногоТипаОплатыМП(ВыбранныйТипОплаты);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСпискиНаКлиенте()
	Элементы.Список.Обновить();
	Элементы.СписокИтоги.Обновить();	
КонецПроцедуры	

&НаКлиенте
Процедура РейсПриИзмененииНаКлиенте()
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныйРейс", ВыбранныйРейс);
	СписокИтоги.Параметры.УстановитьЗначениеПараметра("ВыбранныйРейс", ВыбранныйРейс);
	
	ОбновитьСпискиНаКлиенте();
	ПолучитьПараметрыРейса();		
КонецПроцедуры	

&НаСервере
Процедура ПолучитьПараметрыРейса()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Рейсы.ДатаРейса КАК ДатаРейса,
	|	Рейсы.НомерПалетты КАК НомерПалетты,
	|	Рейсы.НомерРейса КАК НомерРейса,
	|	Рейсы.РаспечатанМЛ КАК РаспечатанМЛ,
	|	Рейсы.ВыданТерминалAssist КАК ВыданТерминалAssist
	|ИЗ
	|	Справочник.Рейсы КАК Рейсы
	|ГДЕ
	|	Рейсы.Ссылка = &ВыбранныйРейс";
	Запрос.УстановитьПараметр("ВыбранныйРейс", ВыбранныйРейс);
	ВыборкаРейс = Запрос.Выполнить().Выбрать();
	Если ВыборкаРейс.Следующий() Тогда
		ВыбранныйРейсНомерПалетты = ВыборкаРейс.НомерПалетты;
		ВыбранныйРейсДатаРейса = ВыборкаРейс.ДатаРейса;
		ПоВыбранномуРейсуРаспечатанМЛ = ВыборкаРейс.РаспечатанМЛ;
		ПоВыбранномуРейсуВыданТерминалAssist = ВыборкаРейс.ВыданТерминалAssist;
		ВыбранныйРейсНомерРейса = ВыборкаРейс.НомерРейса;
	КонецеСли;	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборВыбранногоТипаОплатыМП(Значение)
	Для Каждого ЭлементОтбора Из СписокИтоги.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЗначениеЗаполнено(Значение) Тогда	
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ПравоеЗначение = ВыбранныйТипОплаты;
			Иначе
				ЭлементОтбора.Использование = Ложь;
			КонецеСли;											
		КонецЕСли;	
	КонецЦикла;				
	Элементы.Итоги.Обновить();		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРейсовНаСервере()
	Зап = Новый Запрос();
	Зап.Текст = "ВЫБРАТЬ
	|	Рейсы.Ссылка КАК Рейс
	|ИЗ
	|	Справочник.Рейсы КАК Рейсы
	|ГДЕ
	|	Рейсы.ДатаРейса >= &ДатаРейса
	|	И Рейсы.Транспорт = &Транспорт
	|	И Рейсы.ПометкаУдаления = ЛОЖЬ";
	Зап.УстановитьПараметр("ДатаРейса", ТекущаяДатаСеанса() - 86400*5);
	Зап.УстановитьПараметр("Транспорт", ПараметрыСеанса.ТранспортМП);
	
	Выб = Зап.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Элементы.ВыбранныйРейс.СписокВыбора.Добавить(Выб.Рейс);
	КонецЦикла;	
КонецПроцедуры	

// Поиск и установка рейса на сегодня на сервере.
// 
// Возвращаемое значение:
//  Булево - Рейс был найден
&НаСервере
Функция ПоискИУстановкаРейсаНаСегодняНаСервере();
	Если Не ВыбранныйРейс.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	СтруктураРейса = МаршрутизацияСервер.НайтиРабочийРейсПоТранспортуМП();
	
	Если ЗначениеЗаполнено(СтруктураРейса.Рейс) Тогда
		ВыбранныйРейс = СтруктураРейса.Рейс;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ОбработкаОповещенияВыполненОбменСЦУ(Результат, ДополнительныеПараметры) Экспорт
//	Если ПоискИУстановкаРейсаНаСегодняНаСервере() Тогда
//		РейсПриИзмененииНаКлиенте();				
//	КонецЕсли;
	ПоискИУстановкаРейсаНаСегодняНаСервере();
	РейсПриИзмененииНаКлиенте();
КонецПроцедуры
#КонецОбласти
